Repository: microsoft/vs-streamjsonrpc
Catalog: src/StreamJsonRpc/Resources.*.resx
Languages: es, fr, pt_br, zh_hant

# BothReadableWritableAreNull
source: Both readable and writable are null.
es: La lectura y escritura son NULL.
fr: readable et writable sont tous les deux Null.
pt_br: Legível e gravável são nulos.
zh_hant: Readable 和 Writable 都是 Null。

# DroppingRequestDueToNoTargetObject
source: Got a request to execute '{0}' but have no callback object. Dropping the request.
es: Recibió una solicitud para ejecutar '{0}', pero no hay ningún objeto de devolución de llamada. Anulando la solicitud.
fr: A reçu une demande pour exécuter '{0}' mais n’a aucun objet de rappel. Suppression de la demande.
pt_br: Recebeu uma solicitação para executar '{0}', mas não há nenhum objeto de retorno de chamada. Removendo a solicitação.
zh_hant: 取得執行 '{0}' 的要求，但沒有回呼物件。正在卸除要求。

# ErrorWritingJsonRpcResult
source: Error writing JSON RPC Result: {0}: {1}
es: Error al escribir el resultado de JSON RPC: {0}: {1}
fr: Erreur lors de l’écriture du résultat de JSON RPC : {0} : {1}
pt_br: Erro ao gravar o resultado de RPC de JSON: {0}: {1}
zh_hant: 寫入 JSON RPC 結果時發生錯誤: {0}: {1}

# FailureDeserializingJsonRpc
source: Failure deserializing incoming JSON RPC '{0}': {1}
es: Error al deserializar '{0}' de JSON RPC entrante: {1}
fr: Échec de la désérialisation du protocole JSON RPC entrant '{0}' : {1}
pt_br: Falha ao desserializar o RPC de JSON de entrada '{0}': {1}
zh_hant: 將傳入的 JSON RPC '{0}' 還原序列化失敗: {1}

# JsonRpcCannotBeNull
source: JSON RPC must not be null.
es: JSON RPC no debe ser NULL.
fr: JSON RPC ne doit pas être Null.
pt_br: O RPC de JSON não deve ser nulo.
zh_hant: JSON RPC 不得為 Null。

# MethodHasRefOrOutParameters
source: {0} has ref or out parameter(s), which is not supported
es: {0} tiene los parámetros out o ref no admitidos
fr: {0} a un ou des paramètres ref ou out non pris en charge
pt_br: {0} tem os parâmetros ref ou out, que não têm suporte
zh_hant: {0} 有不支援的 ref 或 out 參數

# MethodParameterCountDoesNotMatch
source: {0} parameter(s) (excluding any CancellationToken): {1}, but the request supplies {2}
es: {0} parámetro(s): {1}, pero la solicitud ofrece {2}
fr: {0} paramètre(s) : {1}, mais la demande fournit {2}
pt_br: Parâmetros {0}: {1}, mas a solicitação fornece {2}
zh_hant: {0} 參數: {1}，但要求提供 {2}

# MethodParametersNotCompatible
source: {0} parameters are not compatible with the arguments provided in the request.
es: Los parámetros {0} no son compatibles con la solicitud: {1}
fr: {0} paramètres ne sont pas compatibles avec la demande : {1}
pt_br: Parâmetros {0} não são compatíveis com a solicitação: {1}
zh_hant: 與 {0} 參數不相容的要求: {1}

source: Reached end of stream.
es: Se alcanzó el final de la secuencia.
fr: Fin de flux atteinte.
pt_br: Fim do fluxo alcançado.
zh_hant: 已到達資料流結尾。

# ReadingJsonRpcStreamFailed
source: Reading JSON RPC from the stream failed with {0}: {1}
es: Error al leer JSON RPC desde la secuencia con {0}: {1}
fr: La lecture de JSON RPC à partir du flux a échoué avec {0} : {1}
pt_br: Falha na leitura de RPC de JSON do fluxo com {0}: {1}
zh_hant: 從資料流讀取 JSON RPC 失敗，發生 {0}: {1}

source: Response is not error.
es: La respuesta no es un error.
fr: La réponse n’est pas une erreur.
pt_br: A resposta não é um erro.
zh_hant: 回應不是錯誤。

# StreamDisposed
source: Stream has been disposed
es: Se ha eliminado la secuencia
fr: Le flux a été supprimé
pt_br: O fluxo foi descartado
zh_hant: 資料流已處置

# TaskNotCompleted
source: The task is not completed.
es: La tarea no está completada.
fr: La tâche n’est pas effectuée.
pt_br: A tarefa não foi concluída.
zh_hant: 工作未完成。

# TaskWasCancelled
source: The task was cancelled.
es: La tarea se canceló.
fr: La tâche a été annulée.
pt_br: A tarefa foi cancelada.
zh_hant: 工作已取消。

# UnableToFindMethod
source: Unable to find method '{0}/{1}' on {2} for the following reasons: {3}
es: No se puede encontrar el método '{0}/{1}' en {2} por las siguientes razones: {3}
fr: Impossible de trouver la méthode '{0}/{1}' sur {2} pour les raisons suivantes : {3}
pt_br: Não é possível encontrar o método '{0}/{1}' em {2} pelos seguintes motivos: {3}
zh_hant: 在 {2} 上找不到方法 '{0}/{1}'，原因如下: {3}

# UnexpectedErrorProcessingJsonRpc
source: Unexpected error processing JSON-RPC message: {0}
es: Error inesperado al procesar '{0}' de JSON RPC: {1}
fr: Erreur inattendue lors du traitement du protocole JSON RPC '{0}' : {1}
pt_br: Erro inesperado ao processar o RPC de JSON '{0}': {1}
zh_hant: 未預期的錯誤處理 JSON RPC '{0}': {1}

# UnrecognizedIncomingJsonRpc
source: Incoming JSON-RPC message did not conform to a recognized pattern.
es: No se reconoce '{0}' de JSON RPC entrante
fr: JSON RPC entrant non reconnu '{0}'
pt_br: RPC de JSON de entrada '{0}' não reconhecido
zh_hant: 無法識別的傳入 JSON RPC '{0}'

# HeaderContentLengthNotParseable
source: Failed parsing Content-Length header into a positive integer.
es: No se pudo analizar encabezado Content-Length en un número entero positivo.
fr: Échec de l’analyse en-tête Content-Length dans un entier positif.
pt_br: Falhou o cabeçalho de Content-Length análise em um número inteiro positivo.
zh_hant: 無法解析內容長度標頭入一個正整數。

# HeaderValueTooLarge
source: The size of the message header exceeds the maximum supported size.
es: El tamaño del encabezado del mensaje supera el tamaño máximo soportado.
fr: La taille de l’en-tête du message dépasse la taille maximale prise en charge.
pt_br: O tamanho do cabeçalho da mensagem excede o tamanho máximo suportado.
zh_hant: 消息標題的大小超過了最大支援的大小。

# UnexpectedTokenReadingHeader
source: Unexpected token '{0}' while parsing header.
es: Inesperado símbolo (token) '{0}' al analizar el encabezado.
fr: Jeton inattendu « {0} » lors de l’analyse d’en-tête.
pt_br: Token inesperado '{0}' durante a análise de cabeçalho.
zh_hant: 意外的標記"{0}"分析標頭時。

# PositiveIntegerRequired
source: A positive integer is required.
es: Se requiere un número entero positivo.
fr: Il faut un nombre entier positif.
pt_br: Um número inteiro positivo é necessário.
zh_hant: 一個正整數是必需的。

# FillBufferFirst
source: The buffer is empty. Call the async method to fill it first.
es: El buffer está vacío. Llame al método async para llenar primero.
fr: Le tampon est vide. Appelez la méthode async pour le remplir tout d’abord.
pt_br: O buffer está vazio. Chame o método de async para preenchê-lo primeiro.
zh_hant: 緩衝區為空。調用非同步方法來第一次填滿它。

# NonNegativeIntegerRequired
source: A non-negative integer is required.
es: Se requiere un número entero no negativo.
fr: Un entier non négatif est nécessaire.
pt_br: Um inteiro não negativo é necessário.
zh_hant: 一個非負整數是必需的。

# SumOfTwoParametersExceedsArrayLength
source: The {0} and {1} parameters exceed length of array.
es: El {0] y {1} parámetros exceden la longitud del array.
fr: Le {0] et paramètres {1} dépassent la longueur du tableau.
pt_br: O {0] e {1} parâmetros excederem o comprimento da matriz.
zh_hant: {0] 和 {1} 參數超過陣列的長度。

# StreamMustBeReadable
source: The stream must be readable.
es: La secuencia debe ser legible.
fr: Le flux doit être lisible.
pt_br: O fluxo deve ser legível.
zh_hant: 流必須清晰易讀。

# StreamMustBeWriteable
source: The stream must be writeable.
es: La corriente debe ser escribible.
fr: Le flux doit être accessible en écriture.
pt_br: O fluxo deve ser gravável.
zh_hant: 流必須可寫。
